# Homebrew package list. These are intended to be installed on *all* my
# machines, so I only list the packages that I *really* need everywhere.
# Packages I only need on some computers are instead installed manually.

tap "homebrew/bundle"
tap "homebrew/services"
tap "homebrew/cask-fonts"

# Shell
brew "atool"
brew "bat"
brew "cloc"
brew "direnv"
brew "entr"
brew "exa"
brew "fd"
brew "fish"
brew "fzf"
brew "htop"
brew "hugo"
brew "iconsur"
brew "latexdiff"
brew "latexindent"
brew "lzip"
brew "moreutils"
brew "neovim"
brew "openconnect"
brew "pandoc"
brew "rg"
brew "tectonic"
brew "tmux"
brew "wget"
brew "zoxide"
brew "zsh"

cask "alfred"
cask "arq"
cask "firefox"
cask "karabiner-elements"
cask "iterm2"
cask "logseq"
cask "macvim"
cask "neovide"
cask "miniconda"
cask "quarto"
cask "skim"
cask "visual-studio-code"
cask "vlc"
cask "yt-music"
cask "zoom"
cask "zotero"
cask "swish"

cask "font-fira-code"
cask "font-fira-mono"
cask "font-fira-sans"
cask "font-jetbrains-mono"
cask "font-juliamono"
cask "font-libertinus"

# HVL
# cask "displaylink"
cask "microsoft-teams"
cask "microsoft-word"
cask "microsoft-excel"
