# Package list for the HomeBrew and LinuxBrew systems.
# Activate this file using the command `brew bundle`.

# Better UNIX IDE.
brew "tmux"
brew "fish"
brew "neovim"
brew "direnv"
brew "entr"
brew "fzf"
brew "nnn"

# Standard commands.
brew "moreutils"
brew "ripgrep"
brew "atool"
brew "lzip"
brew "htop"
brew "bat"
brew "exa"
brew "fd"

# Python packages.
brew "python"
brew "tcl-tk"
brew "poetry"
brew "black"

# Miscellaneous.
brew "graphviz"

# Third-party user apps.
cask "discord"
cask "macvim"
cask "resilio-sync"
cask "signal"
cask "spotify"
cask "steam"
cask "vlc"
cask "vscodium"
cask "zotero"

# Third-party system apps.
cask "arq"
cask "alfred"
cask "bartender"
cask "expressvpn"
cask "iterm2"
cask "little-snitch"
cask "micro-snitch"
cask "mosaic"

# Mac App Store apps.
mas "Bear", id: 1091189122
mas "Diarly", id: 1387167765
mas "Focus Timer", id: 961632517
mas "IM+", id: 1137958278
mas "Master Password", id: 662763204
mas "News Explorer", id: 1032670789
mas "NotePlan", id: 1137020764

# Apple official.
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "iMovie", id: 408981434

# Microsoft office.
mas "Microsoft Excel", id: 462058435
mas "Microsoft Word", id: 462054704
mas "Microsoft PowerPoint", id: 462062816
mas "Microsoft Outlook", id: 985367838
cask "microsoft-teams"

# Safari extensions.
mas "Vimari", id: 1480933944
mas "Wipr", id: 1320666476
