# Package list for the HomeBrew and LinuxBrew systems.
# Activate this file using the command `brew bundle`.

# ------------------------------------------------------------ 
# Command-line applications
# ------------------------------------------------------------ 

# UNIX IDE.
brew "direnv"
brew "entr"
brew "fish"
brew "fzf"
brew "neovim"
brew "nnn"
brew "tmux"

# Documents.
brew "graphviz"
brew "pandoc"
brew "pandoc-citeproc"
brew "pandoc-crossref"
cask "mactex-no-gui"

# Programming.
brew "python"
brew "black"
brew "poetry"
brew "tcl-tk"

# Miscellaneous.
brew "atool"
brew "bat"
brew "exa"
brew "fd"
brew "htop"
brew "lzip"
brew "moreutils"
brew "ripgrep"


# ------------------------------------------------------------ 
# Graphical applications
# ------------------------------------------------------------ 

# User interface.
cask "alfred"
cask "bartender"
cask "mosaic"
mas "vimari", id: 1480933944

# Communication.
cask "discord"
cask "microsoft-teams"
cask "signal"
mas "im+", id: 1137958278

# Entertainment.
cask "spotify"
cask "steam"
cask "vlc"
mas "news-explorer", id: 1032670789

# Productivity.
cask "dash"
cask "iterm2"
cask "macvim"
cask "vscodium"
cask "zotero"
mas "bear", id: 1091189122
mas "noteplan", id: 1137020764
mas "pomodoro", id: 961632517

# Privacy.
cask "expressvpn"
cask "little-snitch"
cask "micro-snitch"
mas "master-password", id: 662763204
mas "wipr", id: 1320666476

# Apple.
mas "imovie", id: 408981434
mas "keynote", id: 409183694
mas "numbers", id: 409203825
mas "pages", id: 409201541

# Microsoft.
mas "excel", id: 462058435
mas "word", id: 462054704
mas "powerpoint", id: 462062816
mas "outlook", id: 985367838

# Backup.
cask "arq"
cask "resilio-sync"
